app/controllers/announcements_controller.rb

SELECT  "announcements".* FROM "announcements" ORDER BY announcementInformation desc LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "announcements"
---
  def index
    @announcements = Announcement.paginate(page: params[:page]).order(sort_column + ' ' + sort_direction)

SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_announcement
      @announcement = Announcement.find(params[:id])