app/controllers/censos_controller.rb

SELECT  "censos".* FROM "censos" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "censos"
---
  def index
    @censos = Censo.paginate(:page => params[:page], :per_page => 20)

DELETE FROM "censos" WHERE "censos"."id" = ?  [["id", 1]]
---
  def destroy
    @censo.destroy

SELECT  "censos".* FROM "censos" WHERE "censos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_censo
      @censo = Censo.find(params[:id])