app/controllers/certificates_controller.rb

SELECT  "certificates".* FROM "certificates" ORDER BY "certificates"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def show
      data_person = Certificate.last

INSERT INTO "certificates" ("created_at", "updated_at", "documentPerson") VALUES (?, ?, ?)  [["created_at", "2017-10-09 23:44:35.082439"], ["updated_at", "2017-10-09 23:44:35.082439"], ["documentPerson", 2222]]
---
  def create
    @certificate = Certificate.new(certificate_params)
    respond_to do |format|
      if @certificate.save

SELECT  "certificates".* FROM "certificates" WHERE "certificates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_certificate
      @certificate = Certificate.find(params[:id])