app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Jhon"], ["email", "jhont285@gmail.com"], ["message", "dfgdfgdf"], ["created_at", "2017-10-11 05:22:33.137694"], ["updated_at", "2017-10-11 05:22:33.137694"]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 101]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
        UserMailer.contact_email(@contact).deliver_later
        @contact.destroy