app/controllers/events_controller.rb

SELECT  "events".* FROM "events" ORDER BY publicationDate asc LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"
---
  def index
    @events = Event.paginate(page: params[:page]).order(sort_column + ' ' + sort_direction)