app/controllers/opinions_controller.rb

  def index
    @opinions = Opinion.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "opinions".* FROM "opinions" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "opinions"