app/controllers/residences_controller.rb

SELECT "residences".* FROM "residences"
---
  def index
    @residences = Residence.all