app/controllers/statistics_controller.rb

SELECT COUNT(*) FROM "censos"
---
  def total
    @num_person_censo = Censo.all.count