app/controllers/statistics_controller.rb

SELECT COUNT(*) AS count_all, "censos"."numberOfChildren" AS censos_numberofchildren FROM "censos" GROUP BY "censos"."numberOfChildren"
---
  def children
    @data = Censo.group(:numberOfChildren).count